Revit 2026 API

# RailingPlacementPosition Enumeration

---

Railing placement position.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailingPlacementPosition
```
```vb
Public Enumeration RailingPlacementPosition
```
```cpp
public enum class RailingPlacementPosition
```
```fsharp
type RailingPlacementPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| Stringer | 1 | Places railing on stringer. |
| Treads | 0 | Places railing on treads. |
| Undefined | -1 | No railing placement. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace